tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"


brew "bat"
brew "blueutil"
brew "sqlite"
brew "cmake"
brew "coreutils"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "git"
brew "git-delta"
brew "htop"
brew "http-server"
brew "httpie"
brew "imagemagick"
brew "mas"
brew "mysql@5.7", restart_service: true
brew "n"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ruby"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "charles"
cask "docker"
cask "font-fira-code"
cask "font-gidole"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "fork"
cask "google-chrome"
cask "hyperswitch"
cask "iterm2"
cask "keka"
cask "monitorcontrol"
cask "postman"
cask "qlmarkdown"
cask "spectacle"
cask "upic"
cask "visual-studio-code"

mas "Xcode", id: 497799835
mas "微信", id: 836500024
mas "QQ音乐", id: 595615424
mas "WPS Office", id: 1468073139
mas "Elmedia Video Player", id: 1044549675
mas "腾讯柠檬清理 (Lemon Cleaner)", id: 1449962996
